#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//指针

//int main()
//{
//	int a = 10; //a占4个字节 - 
//	int * pa=&a; //拿到的是a的4个字节中第一个字节的地址
//	*pa = 10;
//
//	//指针是一个变量，用来存放地址
//	//指针的大小在32位平台是4个字节，在64位平台的8个字节
//
//	return 0;
//}


////int main()
////{
////	int* pa;
////	char* pc;
////	float* pf;
////
////	printf("%d\n", sizeof(pa));
////	printf("%d\n", sizeof(pc));
////	printf("%d\n", sizeof(pf));
////
////	return 0;
////}
////指针类型大小都是一样的
//// 
////指针类型的意义
////1·指针类型决定了指针解引用的权限有多大
////2·指针类型决定了指针走一步能走多远（整形+1走四个字节，char走1个）
////
//int main()
//{
//	int arr[10] = { 0 };
//	int* p = arr;
//	char* pc = arr;
//	printf("%p\n", p);
//	printf("%p\n", p+1);
//
//	printf("%p\n", pc);
//	printf("%p\n", pc+1);
//	////十六进制 0 1 2 3 4 5 6 7 8 9 a b c d e f
//	////11111111
//	////    8421   =15=f 一个f至少要4个二进制位
//	//int a = 0x11223344;
//
//	//char* pc = &a;
//	//*pc = 0;
//
//	///*int*pa=&a;
//	//*pa = 0;*/
//
//	return 0;
//}

//int main()
//{
//	//1·
//	////这里p就是一个野指针
//	//int* p;//p是一个局部的指针变，局部变量不初始化的话，默认是随机值
//	//*p = 20;//非法访问内存（指针没有初始化，指针存在随机值，不属于当前程序）
//
//	//2·
//	//int arr[10] = { 0 };
//	//int* p = arr;
//	//int i = 0;
//	//for (i = 0; i <= 10; i++)
//	//{
//	//	//当指针指向范围超出数组arr的范围时；p就是野指针
//	//	*p = i;
//	//	p++;
//	//}
//
//	//3·
//	//指针指向的空间释放
//
//	//如何规避野指针？
//	//1.指针初始化
//	//2.小心指针越界
//	//3.指针指向空间释放即放置NULL
//	//4.指针使用之前检查有效性
//
//	////当不知道p应该初始化为什么地址的时候，直接初始化为MULL
//	//int* p = NULL;
//	////明确知道初始化的值
//	//int a = 10;
//	//int ptr = &a;
//
//	////c语言本身是不会检查数据越界行为的
//
//	return 0;
//}

//指针数组--数组
//存放指针的数组
int main()
{
	int arr[10];//整形数组 - 存放整形的数组就是整形数组
	char ch[5];//字符数组 - 存放字符的数组
	int* parr[5];//整形指针数组 - 存放整形指针的数组
	return 0;
}