#define _CRT_SECURE_NO_WARNINGS 1
//一维数组
#include <stdio.h>
//int main()
//{
//	////int arr[8];
//	////char ch[5];
//	////int n = 8;
//	////int arr[n];//错误！[]内必须为常量表达式
//	//int a = 10;//初始化
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//完全初始化
//	//int arr[10] = { 1,2,3,4,5 };//不完全初始化
//	//int arr2[] = { 1,2,3,4,5 };//没有给数组长度，则依据{}内长度赋给前面[]
//
//	//char ch1[5] = { 'b','i','t' };//字符数组初始化 ，用''
//	//char ch2[] = { 'b','i','t' };
//
//	//char ch3[5] = "bit";// b i t \0 0 不完全初始化，字符串以\0结束故有一个\0
//	//char ch4[] = "bit";//b i t \0 四个元素
//
//	//char ch5[] = "bit";
//	////[b i t \0]
//	//char ch6[] = { 'b','i','t' };//求数组长度strlen（）时得到结果为随机值，因为没有\0截至符不知道后面是什么
//	////[b i t]
//
//
//	return 0;
//}

////一维数组的使用
//int main()
//{
//	int arr[10] = { 0 };//数组下标从0开始
//
//	arr[4] = 5;//[]-下标引用操作符
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]); //  总大小 / 第一个元素大小 = 数组大小
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}
////数组是使用下标来访问的，下标是从0开始的。
////数组的大小是可以通过计算得到的。
//


////%p-是按地址的格式打印-十六进制的打印
//
////int main()
////{
////	int arr[10] = { 0 };
////	int i = 0;
////	for (i = 0; i < 10; i++)
////	{
////		printf("&arr[%d]=%p\n", i, &arr[i]);
////	}
////	return 0;
////}
//////一维数组在内存中连续存放  随着数组下标的增长，地址是由低到高变化的

//二维数组

//int main()
//{
//	//int arr[3][4];//三行四列数组 整形
//	//char ch[3][10];//三行十列 
//	//初始化 - 创建的同时赋值
//	//int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };//按次序依次一行一行往下
//	//int arr[3][4] = { 1,2,3,4,5,6,7 };//不完全初始化
//	//int arr[3][4] = { {1,2},{3,4},{5,6} };//第一行1 2 0 0  第二行3 4 0 0 第三行同理
//	//int arr[][4]= { {1,2},{3,4},{5,6} };//二维数组行可以省略，列不可省略
//
//	//二维数组第一行行号为0，第一列列号为0  arr[1][2]行号为1列号为2的数
//
//
//	int arr[][4] = { {1,2},{3,4},{4,5} };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}


////冒泡排序思想：两两相邻元素比较，并且可能的话需要交换
//void bubble_sort(int arr[],int sz)//形参arr本质是指针
//{
//	//计算元素个数
//	
//	//10个元素，9次比较  确定比较次数
//	int i = 0;
//	for (i = 0; i < sz - 1; i++)
//	{
//		//一次冒泡排序的过程
//		int j = 0;
//		for (j = 0; j < sz - 1; j++)
//		{
//			if (arr[j] > arr[j + 1])
//			{
//				//交换
//				int tmp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = tmp;
//			}
//		}
//	}
//}
//int main()
//{
//	int arr[] = { 9,8,7,6,5,4,3,2,1,0 };
//	//排序为升序 - 冒泡排序
//	//计算数组元素个数
//	int sz = sizeof(arr) / sizeof(arr[0]);//
//	bubble_sort(arr,sz);//!!!!数组传参的时候，传的是数组首元素的地址
//
//	return 0;
//}

//!!!数组名是数组首元素的地址
//! 但有两个例外
//1·sizeof（数组名）- 数组名表示整个数组 - 计算的是整个数组的大小，单位是字节
//2·&数组名 - 数组名表示整个数组 - 取出的是整个数组的地址


